000010171012     A*%%TS  SD  20171012  105523  FMARTIN     REL-V7R3M0  5770-WDS
000020171012     A*%%EC
000030171012     A                                      DSPSIZ(24 80 *DS3)
000040171012     A                                      PRINT(*LIBL/QSYSPRT)
000050171012     A                                      CF01(15)
000060171012     A                                      CF02(15)
000070171012     A                                      CF03(15)
000080171012     A                                      CF04(15)
000090171012     A                                      CF05(15)
000100171012     A                                      CF06(15)
000110171012     A                                      CF07(15)
000120171012     A                                      CF08(15)
000130171012     A                                      CF09(15)
000140171012     A                                      CF10(15)
000150171012     A                                      CF11(15)
000160171012     A                                      CF12(15)
000170171012     A                                      CF13(15)
000180171012     A                                      CF14(15)
000190171012     A                                      CF15(15)
000200171012     A                                      CF16(15)
000210171012     A                                      CF17(15)
000220171012     A                                      CF18(15)
000230171012     A                                      CF19(15)
000240171012     A                                      CF20(15)
000250171012     A                                      CF21(15)
000260171012     A                                      CF22(15)
000270171012     A                                      CF23(15)
000280171012     A                                      CF24(15)
000290171012     A                                      HELP(15)
000300171012     A                                      ROLLDOWN(15)
000310171012     A                                      ROLLUP(15)
000320171012     A                                      VLDCMDKEY(15 'ANY VALID COMMAND KEY-
000330171012     A                                      ')
000340171011     A          R HEADER
000350171011     A*%%TS  SD  20171011  110224  FMARTIN     REL-V7R3M0  5770-WDS
000360171011     A                                  1  3SYSNAME
000370171011     A                                  1 34'Source control'
000380171011     A                                  1 72DATE
000390171011     A                                      EDTCDE(Y)
000400171011     A                                  2 72TIME
000410171011     A                                  3  3'                                  -
000420171011     A                                                                         -
000430171011     A                                              '
000440171011     A                                      DSPATR(UL)
000450171011     A                                  4  3'Name . . . :'
000460171011     A                                  5  3'Type . . . :'
000470171011     A                                  6  3'Description:'
000480171011     A                                  7  3'                                  -
000490171011     A                                                                         -
000500171011     A                                              '
000510171011     A                                      DSPATR(UL)
000520171011     A            RNAME         10A  B  4 16
000530171011     A            RTYPE         10A  B  5 16
000540171011     A            RDESC         50A  B  6 16
000550171011     A          R FOOTER
000560171011     A*%%TS  SD  20171011  110224  FMARTIN     REL-V7R3M0  5770-WDS
000570171011     A                                 23  3'F3=Exit'
000580171011     A                                 23 13'F4=Prompt'
000590171011     A                                 23 25'1=Copy'
000600171011     A                                 23 34'2=Delete'
000610171011     A                                 23 45'3=Compile'
000620171012     A          R DETAIL                    SFL
000630171012     A*%%TS  SD  20171012  105523  FMARTIN     REL-V7R3M0  5770-WDS
000640171012     A  11                                  SFLNXTCHG
000650171012     A            XXN001         8S 0H
000660171012     A            RLIBSRC       10A  B  9  8
000670171012     A            RLIB          10A  B  9 20
000680171012     A            RUSR          10A  B  9 31
000690171012     A            RDATE          8A  B  9 42
000700171012     A            OPT            2A  I  9  4
000710171012     A          R DETAILSF                  SFLCTL(DETAIL)
000720171012     A*%%TS  SD  20171012  105523  FMARTIN     REL-V7R3M0  5770-WDS
000730171012     A                                      SFLSIZ(0100)
000740171012     A                                      SFLPAG(0010)
000750171012     A                                      RTNCSRLOC(&###CRC &###CFL)
000760171012     A                                      CSRLOC(##RROW     ##RCOL)
000770171012     A                                      SFLCSRRRN(&###RNO)
000780171012     A N12                                  SFLDSP
000790171012     A N12                                  SFLDSPCTL
000800171012     A  12                                  SFLCLR
000810171012     A  13                                  SFLEND(*MORE)
000820171012     A            ###NBR         4S 0H      SFLRCDNBR(CURSOR)
000830171012     A            ###RNO         5S 0H
000840171012     A            ##RROW         3S 0H
000850171012     A            ##RCOL         3S 0H
000860171012     A            ###CRC        10A  H
000870171012     A            ###CFL        10A  H
000880171012     A                                  8  3'Opt.'
000890171012     A                                      DSPATR(UL)
000900171012     A                                  8  8'Source lib.'
000910171012     A                                      DSPATR(UL)
000920171012     A                                  8 20'Library   '
000930171012     A                                      DSPATR(UL)
000940171012     A                                  8 31'Programmer'
000950171012     A                                      DSPATR(UL)
000960171012     A                                  8 42'Date    '
000970171012     A                                      DSPATR(UL)
