000100000000     A                                      CF06(06 'ADD')
000200000000     A                                      CA12(12 'CANLE')
000300000000     A                                      CA03(03 'EXIT')
000400000000     A                                      CF10(10 'Process')
000500000000     A                                      CF04(04 'PROMPT')
000600000000     A                                      CF05(05 'REFRESH')
000700000000      *?-----------------------------------
000800000000      *?  Header Format
000900000000      *?-----------------------------------
001000000000     A          R HEADER
001100000000     A                                      OVERLAY
001200000000     A                                  1  2DATE EDTCDE(Y)
001300000000     A                                  1 34'MAIN HEADING'
001400000000     A                                  1 71'SRC'
001500000000     A                                  2  2TIME
001600000000     A                                  2 29'SPACE FOR SUB HEADING'
001700000000     A                                  2 71USER
001800000000      *?-----------------------------------
001900000000      *?  Message Subfile
002000000000      *?-----------------------------------
002100000000     A          R MSGRC001                  SFL
002200000000     A                                      TEXT('MESSAGE SUBFILE')
002300000000     A                                      SFLMSGRCD(24)
002400000000     A            MSGKEY                    SFLMSGKEY
002500000000     A            PROGRAMQ                  SFLPGMQ
002600000000     A          R MSGCTL01                  SFLCTL(MSGRC001    )
002700000000     A                                      TEXT('MESSAGE SUBFCTL')
002800000000     A                                      OVERLAY
002900000000     A                                      SFLDSP
003000000000     A                                      SFLDSPCTL
003100000000     A                                      SFLINZ
003200000000     A N49                                  SFLEND
003300000000     A                                      SFLSIZ(0002)
003400000000     A                                      SFLPAG(0001)
003500000000     A            PROGRAMQ                  SFLPGMQ(10)
003600000000      *?-----------------------------------
003700000000      *?  Subfile Record format
003800000000      *?-----------------------------------
003900000000     A          R SFLRCD001                 SFL
004000000000     A  99                                  SFLNXTCHG
004100000000     A            DSFLOPTION     1A  B 10  2
004200000000     A                                      COLOR(GRN)
004300000000     A            DRNAME        10A  O 10  6
004400000000     A                                      COLOR(GRN)
004500000000     A            DRDESC        50A  O 10 17
004600000000     A                                      COLOR(GRN)
004700000000     A            DRTYPE        10A  O 10 68
004800000000     A                                      COLOR(GRN)
004900000000      *?-----------------------------------
005000000000      *?  Subfile Control format
005100000000      *?-----------------------------------
005200000000     A          R SFLCTL001                 SFLCTL(SFLRCD001    )
005300000000     A                                      SFLSIZ(12)
005400000000     A                                      SFLPAG(11)
005500000000     A                                      OVERLAY
005600000000     A  40                                  SFLDSP
005700000000     A  41                                  SFLDSPCTL
005800000000     A  42                                  SFLCLR
005900000000     A  43                                  SFLINZ
006000000000     A                                      SFLRNA
006100000000     A  44                                  SFLEND(*MORE)
006200000000     A            DSPRCDNBR      4S 0H      SFLRCDNBR(CURSOR)
006300000000     A                                  4  1'Position To:'
006400000000     A                                      COLOR(BLU)
006500000000     A                                  4 14'RNAME:'
006600000000     A            S1RNAME       10A  B  4 21
006700000000     A                                      COLOR(WHT)
006800000000     A                                  5  1'RDESC:'
006900000000     A            S1RDESC       50A  B  5  8
007000000000     A                                      COLOR(WHT)
007100000000     A                                  5 59'RTYPE:'
007200000000     A            S1RTYPE       10A  B  5 66
007300000000     A                                      COLOR(WHT)
007400000000     A                                  7  1'Options:'
007500000000     A                                      COLOR(BLU)
007600000000     A                                  7 10'I=Inquiry'
007700000000     A                                      COLOR(BLU)
007800000000     A                                  7 20'X=Change'
007900000000     A                                      COLOR(BLU)
008000000000     A                                  7 29'D=Delete'
008100000000     A                                      COLOR(BLU)
008200000000     A                                  9  2'OPT'
008300000000     A                                      DSPATR(UL)
008400000000     A                                      COLOR(WHT)
008500000000     A                                  9  6'RNAME'
008600000000     A                                      DSPATR(UL)
008700000000     A                                      COLOR(WHT)
008800000000     A                                  9 17'RDESC'
008900000000     A                                      DSPATR(UL)
009000000000     A                                      COLOR(WHT)
009100000000     A                                  9 68'RTYPE'
009200000000     A                                      DSPATR(UL)
009300000000     A                                      COLOR(WHT)
009400000000      *?-----------------------------------
009500000000      *?  Add Screen
009600000000      *?-----------------------------------
009700000000     A          R ADDRECORD
009800000000     A                                      OVERLAY
009900000000     A                                  4  2'Add New Record'
010000000000     A                                      DSPATR(UL)
010100000000     A                                      COLOR(BLU)
010200000000     A                                  6  2'RNAME.:'
010300000000     A            X1RNAME       10A  B  6 10
010400000000     A  61                                  DSPATR(RI PC)
010500000000     A                                  7  2'RDESC.:'
010600000000     A            X1RDESC       50A  B  7 10
010700000000     A  62                                  DSPATR(RI PC)
010800000000     A                                  8  2'RTYPE.:'
010900000000     A            X1RTYPE       10A  B  8 10
011000000000     A  63                                  DSPATR(RI PC)
011100000000     A                                 21 70'Bottom '
011200000000     A                                      COLOR(WHT)
011300000000      *?-----------------------------------
011400000000      *?  Update Screen
011500000000      *?-----------------------------------
011600000000     A          R CHGRECORD
011700000000     A                                      OVERLAY
011800000000     A                                  4  2'Change Record'
011900000000     A                                      DSPATR(UL)
012000000000     A                                      COLOR(BLU)
012100000000     A                                  6  2'RNAME.:'
012200000000     A            C1RNAME       10A  B  6 10
012300000000     A  61                                  DSPATR(RI PC)
012400000000     A                                  7  2'RDESC.:'
012500000000     A            C1RDESC       50A  B  7 10
012600000000     A  62                                  DSPATR(RI PC)
012700000000     A                                  8  2'RTYPE.:'
012800000000     A            C1RTYPE       10A  B  8 10
012900000000     A  63                                  DSPATR(RI PC)
013000000000     A                                 21 70'Bottom '
013100000000     A                                      COLOR(WHT)
013200000000      *?-----------------------------------
013300000000      *?  Inquiry Screen
013400000000      *?-----------------------------------
013500000000     A          R INQRECORD
013600000000     A                                      OVERLAY
013700000000     A                                  4  2'Details....'
013800000000     A                                      DSPATR(UL)
013900000000     A                                      COLOR(BLU)
014000000000     A                                  6  2'RNAME.:'
014100000000     A            I1RNAME       10A  O  6 10
014200000000     A                                  7  2'RDESC.:'
014300000000     A            I1RDESC       50A  O  7 10
014400000000     A                                  8  2'RTYPE.:'
014500000000     A            I1RTYPE       10A  O  8 10
014600000000     A                                 21 70'Bottom '
014700000000     A                                      COLOR(WHT)
014800000000      *?-----------------------------------
014900000000      *?  Delete Screen
015000000000      *?-----------------------------------
015100000000     A          R DLTRECORD
015200000000     A                                      OVERLAY
015300000000     A                                  4  2'Delete Record'
015400000000     A                                      DSPATR(UL)
015500000000     A                                      COLOR(BLU)
015600000000     A                                  6  2'RNAME.:'
015700000000     A            D1RNAME       10A  O  6 10
015800000000     A                                  7  2'RDESC.:'
015900000000     A            D1RDESC       50A  O  7 10
016000000000     A                                  8  2'RTYPE.:'
016100000000     A            D1RTYPE       10A  O  8 10
016200000000     A                                 21 70'Bottom '
016300000000     A                                      COLOR(WHT)
016400000000      *?-----------------------------------
016500000000      *?  Footer for Main subfile
016600000000      *?-----------------------------------
016700000000     A          R FOOTER
016800000000     A                                      OVERLAY
016900000000     A                                 22  2'F3=EXIT  -
017000000000     A                                      F5=REFRESH  -
017100000000     A                                      F6=ADD  -
017200000000     A                                      F12=CANCEL'
017300000000     A                                      COLOR(BLU)
017400000000      *?-----------------------------------
017500000000      *?  Footer 2 Add/Update/Delete
017600000000      *?-----------------------------------
017700000000     A          R FOOTER2
017800000000     A                                      OVERLAY
017900000000     A                                 22  2'F3=EXIT  -
018000000000     A                                      F10=PROCESS  -
018100000000     A                                      F12=CANCEL'
018200000000     A                                      COLOR(BLU)
018300000000      *?-----------------------------------
018400000000      *?  Footer 3 Inquery/Search
018500000000      *?-----------------------------------
018600000000     A          R FOOTER3
018700000000     A                                      OVERLAY
018800000000     A                                 22  2'F3=EXIT  -
018900000000     A                                      F12=CANCEL'
019000000000     A                                      COLOR(BLU)
019100000000      *?-----------------------------------
019200000000      *?  Empty Subfile
019300000000      *?-----------------------------------
019400000000     A          R EMPTYSFL
019500000000     A                                 15 29'No Record Found'
