000100171011     A          R RSRCH
000200171011     A                                      TEXT('SOURCE DESC. HEADER')
000300171011     A            RNAME         10A
000400171011     A            RDESC         50A
000500171011     A            RTYPE         10A
000600171011     A          K RNAME
