000010171013     A*%%TS  SD  20171013  115243  FMARTIN     REL-V7R3M0  5770-WDS
000020171013     A*%%EC
000030171013     A                                      DSPSIZ(24 80 *DS3)
000040171013     A                                      PRINT(*LIBL/QSYSPRT)
000050171013     A                                      CF01(15)
000060171013     A                                      CF02(17)
000070171013     A                                      CF03(18)
000080171013     A                                      CF04(15)
000090171013     A                                      CF05(15)
000100171013     A                                      CF06(15)
000110171013     A                                      CF07(15)
000120171013     A                                      CF08(15)
000130171013     A                                      CF09(15)
000140171013     A                                      CF10(15)
000150171013     A                                      CF11(15)
000160171013     A                                      CF12(15)
000170171013     A                                      CF13(15)
000180171013     A                                      CF14(15)
000190171013     A                                      CF15(15)
000200171013     A                                      CF16(15)
000210171013     A                                      CF17(15)
000220171013     A                                      CF18(15)
000230171013     A                                      CF19(15)
000240171013     A                                      CF20(15)
000250171013     A                                      CF21(15)
000260171013     A                                      CF22(15)
000270171013     A                                      CF23(15)
000280171013     A                                      CF24(15)
000290171013     A                                      HELP(15)
000300171013     A*                                     ROLLDOWN(16)
000310171013     A                                      ROLLUP(17)
000320171013     A                                      VLDCMDKEY(15 'Any valid command key-
000330171013     A                                      -')
000340171012     A          R HEADER
000350171013     A*                                     KEEP
000360171013     A*                                     OVERLAY
000370171012     A*%%TS  SD  20171012  104355  FMARTIN     REL-V7R3M0  5770-WDS
000380171012     A                                  1  2SYSNAME
000390171012     A                                  1 34'Source manger'
000400171012     A                                  1 72DATE
000410171012     A                                      EDTCDE(Y)
000420171012     A                                  2 72TIME
000430171012     A                                  3  2'                                  -
000440171012     A                                                                         -
000450171012     A                                               '
000460171012     A                                      DSPATR(UL)
000470171012     A                                  4  3'Position to Name  :'
000480171012     A                                  5  3'Type. . . . . . . :'
000490171012     A                                  6  3'Locate Description:'
000500171012     A            HNAME         10   I  4 24
000510171012     A            HTYPE         10   I  5 24
000520171012     A            HDESC         50   I  6 24
000530171012     A                                  7  2'                                  -
000540171012     A                                                                         -
000550171012     A                                               '
000560171012     A                                      DSPATR(UL)
000570171013     A          R FOOTER
000580171013     A*%%TS  SD  20171013  115243  FMARTIN     REL-V7R3M0  5770-WDS
000590171013     A                                      KEEP
000600171013     A                                      OVERLAY
000610171013     A                                 22 10'F3=Exit'
000620171013     A                                 22 26'1=Edit'
000630171013     A                                 22 52'9=Delete'
000640171013     A                                 22  2'F2=Add'
000650171013     A                                 22 21'Opt.'
000660171013     A                                 22 34'2=Select'
000670171013     A                                 22 44'3=Copy'
000680171013     A          R RECORD                    SFL
000690171013     A*%%TS  SD  20171013  115243  FMARTIN     REL-V7R3M0  5770-WDS
000700171013     A  10                                  SFLNXTCHG
000710171013     A            SOPT           2A  B  9  4
000720171013     A            STYPE         10A  O  9 20
000730171013     A            SDESC         50A  O  9 31
000740171013     A            SNAME         10   O  9  9
000750171013     A          R RECORDCTL                 SFLCTL(RECORD)
000760171013     A*%%TS  SD  20171013  115243  FMARTIN     REL-V7R3M0  5770-WDS
000770171013     A                                      SFLSIZ(0100)
000780171013     A                                      SFLPAG(0010)
000790171013     A                                      KEEP
000800171013     A                                      OVERLAY
000810171013     A  12                                  SFLDSP
000820171013     A  12                                  SFLDSPCTL
000830171013     A  13                                  SFLINZ
000840171013     A  14                                  SFLCLR
000850171013     A  15                                  SFLEND(*MORE)
000851171013     A            I1             4S 0H      SFLRCDNBR
000860171013     A            ###REC         4S 0H
000870171013     A            ###FLD         4S 0H
000880171013     A            ###POS         4S 0H
000890171013     A            ###RROW        4S 0H
000900171013     A            ###RCOL        4S 0H
000910171013     A            #SFRNO         4S 0H
000920171013     A                                  8  3'Opt.'
000930171013     A                                      DSPATR(UL)
000940171013     A                                  8 20'Type      '
000950171013     A                                      DSPATR(UL)
000960171013     A                                  8 31'Description                       -
000970171013     A                                                      '
000980171013     A                                      DSPATR(UL)
000990171013     A                                  8  9'Name      '
001000171013     A                                      DSPATR(UL)
