000001171117000100171117             PGM
000002171117000101171117             /* Test 2/
000003171117000102171117             /* Test conflit 33
000400171115
010800171117000200171115DCL &FAILED TYPE(*DEC) LEN(10 0) VALUE(0)
010900171117000300171115DCL &FAILEDSTR TYPE(*CHAR) LEN(10)
011000171117000400171115
011100171117000500171115CHGPF SRCFILE(FMARTIN1/QDDSSRC) SRCMBR(SRCD) OPTION(*EVENTF)  FILE(FMARTIN1/SRC-
011200171117000600171115D)
011300171117000700171115MONMSG MSGID(CPF0000) EXEC(DO)
011400171117000800171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
011500171117000900171115ENDDO
011600171117001000171115
011700171117001100171115CHGPF SRCFILE(FMARTIN1/QDDSSRC) SRCMBR(SRCH) OPTION(*EVENTF)  FILE(FMARTIN1/SRC-
011800171117001200171115H)
011900171117001300171115MONMSG MSGID(CPF0000) EXEC(DO)
012000171117001400171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
012100171117001500171115ENDDO
012200171117001600171115
012300171117001700171115CHGPF SRCFILE(FMARTIN1/QDDSSRC) SRCMBR(SRCTYPE) OPTION(*EVENTF)  FILE(FMARTIN1/-
012400171117001800171115SRCTYPE)
012500171117001900171115MONMSG MSGID(CPF0000) EXEC(DO)
012600171117002000171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
012700171117002100171115ENDDO
012800171117002200171115
012900171117002300171115CRTDSPF SRCFILE(FMARTIN1/QDDSSRC) SRCMBR(SRCCTRL) REPLACE(*YES) OPTION(*EVENTF)-
013000171117002400171115  FILE(FMARTIN1/SRCCTRL)
013100171117002500171115MONMSG MSGID(CPF0000) EXEC(DO)
013200171117002600171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
013300171117002700171115ENDDO
013400171117002800171115
013500171117002900171115CRTDSPF SRCFILE(FMARTIN1/QDDSSRC) SRCMBR(SRCDSPF) REPLACE(*YES) OPTION(*EVENTF)-
013600171117003000171115  FILE(FMARTIN1/SRCDSPF)
013700171117003100171115MONMSG MSGID(CPF0000) EXEC(DO)
013800171117003200171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
013900171117003300171115ENDDO
014000171117003400171115
014100171117003500171115CRTDSPF SRCFILE(FMARTIN1/QDDSSRC) SRCMBR(SRCMAIN) REPLACE(*YES) OPTION(*EVENTF)-
014200171117003600171115  FILE(FMARTIN1/SRCMAIN)
014300171117003700171115MONMSG MSGID(CPF0000) EXEC(DO)
014400171117003800171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
014500171117003900171115ENDDO
014600171117004000171115
014700171117004100171115CRTDSPF SRCFILE(FMARTIN1/QDDSSRC) SRCMBR(TESTD2) REPLACE(*YES) OPTION(*EVENTF) -
014800171117004200171115 FILE(FMARTIN1/TESTD2)
014900171117004300171115MONMSG MSGID(CPF0000) EXEC(DO)
015000171117004400171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
015100171117004500171115ENDDO
015200171117004600171115
015300171117004700171115CRTDSPF SRCFILE(FMARTIN1/QDDSSRC) SRCMBR(TESTD4) REPLACE(*YES) OPTION(*EVENTF) -
015400171117004800171115 FILE(FMARTIN1/TESTD4)
015500171117004900171115MONMSG MSGID(CPF0000) EXEC(DO)
015600171117005000171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
015700171117005100171115ENDDO
015800171117005200171115
015900171117005300171115CRTICFF SRCFILE(FMARTIN1/QDDSSRC) SRCMBR(ICFTEST) REPLACE(*YES)  FILE(FMARTIN1/-
016000171117005400171115ICFTEST)
016100171117005500171115MONMSG MSGID(CPF0000) EXEC(DO)
016200171117005600171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
016300171117005700171115ENDDO
016400171117005800171115
016500171117005900171115SBMJOB CMD(CALL PGM(XCRPG00) PARM('SRCCTRL' 'QRPGLESRC' 'FMARTIN1' ' ')) JOB(SR-
016600171117006000171115CCTRL) MSGQ(*NONE)
016700171117006100171115MONMSG MSGID(CPF0000) EXEC(DO)
016800171117006200171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
016900171117006300171115ENDDO
017000171117006400171115
017100171117006500171115SBMJOB CMD(CALL PGM(XCRPG00) PARM('SRCMAIN' 'QRPGLESRC' 'FMARTIN1' ' ')) JOB(SR-
017200171117006600171115CMAIN) MSGQ(*NONE)
017300171117006700171115MONMSG MSGID(CPF0000) EXEC(DO)
017400171117006800171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
017500171117006900171115ENDDO
017600171117007000171115
017700171117007100171115CRTSQLRPGI OBJ(FMARTIN1/SRC) SRCFILE(FMARTIN1/QRPGLESRC) SRCMBR(SRC) REPLACE(*Y-
017800171117007200171115ES) OPTION(*EVENTF) DBGVIEW(*SOURCE)
017900171117007300171115MONMSG MSGID(CPF0000) EXEC(DO)
018000171117007400171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
018100171117007500171115ENDDO
018200171117007600171115
018300171117007700171115CRTSQLRPGI OBJ(FMARTIN1/TESTR2) SRCFILE(FMARTIN1/QRPGLESRC) SRCMBR(TESTR2) REPL-
018400171117007800171115ACE(*YES) OPTION(*EVENTF) DBGVIEW(*SOURCE)
018500171117007900171115MONMSG MSGID(CPF0000) EXEC(DO)
018600171117008000171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
018700171117008100171115ENDDO
018800171117008200171115
018900171117008300171115CRTSQLRPGI OBJ(FMARTIN1/TESTR4) SRCFILE(FMARTIN1/QRPGLESRC) SRCMBR(TESTR4) REPL-
019000171117008400171115ACE(*YES) OPTION(*EVENTF) DBGVIEW(*SOURCE)
019100171117008500171115MONMSG MSGID(CPF0000) EXEC(DO)
019200171117008600171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
019300171117008700171115ENDDO
019400171117008800171115
019500171117008900171115SBMJOB CMD(CALL PGM(XCRPG00) PARM('TESTRPG' 'QRPGLESRC' 'FMARTIN1' ' ')) JOB(TE-
019600171117009000171115STRPG) MSGQ(*NONE)
019700171117009100171115MONMSG MSGID(CPF0000) EXEC(DO)
019800171117009200171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
019900171117009300171115ENDDO
020000171117009400171115
020100171117009500171115CRTCLPGM PGM(FMARTIN1/TEST) SRCFILE(FMARTIN1/QCLSRC) SRCMBR(TEST) REPLACE(*YES)-
020200171117009600171115 OPTION(*SRCDBG)
020300171117009700171115MONMSG MSGID(CPF0000) EXEC(DO)
020400171117009800171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
020500171117009900171115ENDDO
020600171117010000171115
020700171117010100171115CRTCLPGM PGM(FMARTIN1/QCLSRC) SRCFILE(FMARTIN1/QCLSRC1) SRCMBR(QCLSRC) REPLACE(-
020800171117010200171115*YES) OPTION(*SRCDBG)
020900171117010300171115MONMSG MSGID(CPF0000) EXEC(DO)
021000171117010400171115  CHGVAR VAR(&FAILED) VALUE(&FAILED + 1)
021100171117010500171115ENDDO
021200171117010600171115
021300171117010700171115CHGVAR VAR(&FAILEDSTR) VALUE(&FAILED)
021400171117010800171115ADDENVVAR ENVVAR(QRB_NUMBER_FAILED) VALUE(&FAILEDSTR) REPLACE(*YES)
021500171117010900171115ENDPGM
